<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 10 changes.</summary>

```diff
~ module.coreos-module-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
+ module.coreos-module-vm.htpasswd_password.password_hash will be created
! module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
- module.coreos-module-vm.terraform_data.password_hash will be destroyed
# (because terraform_data.password_hash is not in configuration)
~ module.coreos-module-vm2.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
+ module.coreos-module-vm2.htpasswd_password.password_hash will be created
! module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
- module.coreos-module-vm2.terraform_data.password_hash will be destroyed
# (because terraform_data.password_hash is not in configuration)
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 6 to add, 0 to change, 6 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-11T05:33:54Z [(view log)](https://github.com/perchnet/p/actions/runs/16212636367/job/45775487574#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.coreos-module-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.5.0
                storage:
                  files:
                    - path: /etc/zincati/config.d/90-disable-feature.toml
                      contents:
                        inline: |
                          [updates]
                          enabled = false
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm.htpasswd_password.password_hash will be created
  + resource "htpasswd_password" "password_hash" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$gD3Ef3BWPsf41PHy54sHAOmHdPi7PyGpthJ3xyA2UUtczNoPTshrG"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - files = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,stunning-bear"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  - systemd         = {}
                }
            ) -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "132" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:F2:C7:35",
        ] -> (known after apply)
        name                    = "stunning-bear"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 132 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-132-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:F2:C7:35" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm.terraform_data.password_hash will be destroyed
  # (because terraform_data.password_hash is not in configuration)
  - resource "terraform_data" "password_hash" {
      - id               = "037957e1-3291-5b47-a864-5cbdc48fedce" -> null
      - input            = (sensitive value) -> null
      - output           = "$2a$10$gD3Ef3BWPsf41PHy54sHAOmHdPi7PyGpthJ3xyA2UUtczNoPTshrG" -> null
      - triggers_replace = [
          - "core",
          - (sensitive value),
        ] -> null
    }

  # module.coreos-module-vm2.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.5.0
                storage:
                  files:
                    - path: /etc/zincati/config.d/90-disable-feature.toml
                      contents:
                        inline: |
                          [updates]
                          enabled = false
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm2.htpasswd_password.password_hash will be created
  + resource "htpasswd_password" "password_hash" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$aeUY5pt5VQ.dRWxVst8QUe0XH.Sl3mP/e9zBDOAay/NWpH3BNqjgq"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - files = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,up-unicorn"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  - systemd         = {}
                }
            ) -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:E6:08:1C",
        ] -> (known after apply)
        name                    = "up-unicorn"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:E6:08:1C" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm2.terraform_data.password_hash will be destroyed
  # (because terraform_data.password_hash is not in configuration)
  - resource "terraform_data" "password_hash" {
      - id               = "19cc5958-94f8-0ed0-c76e-995d79afa60a" -> null
      - input            = (sensitive value) -> null
      - output           = "$2a$10$aeUY5pt5VQ.dRWxVst8QUe0XH.Sl3mP/e9zBDOAay/NWpH3BNqjgq" -> null
      - triggers_replace = [
          - "core",
          - (sensitive value),
        ] -> null
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-15-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->